Catalogs/ПроизводственныеКомплекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПроизводственныеКомплекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомплектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подрядчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подрядчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Производство</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПроизводства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачинатьЧерез</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСотрудников</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приоритеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПроизводственныеКомплекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем НачальныйЭтап, РасписаниеИзменено;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		//ЭтаФорма.КарточкаКанбан = омКанбан.ПолучитьКарточкуКанбан(Объект.Ссылка);
		ЗаполнитьДанныеМонтажа();	
	КонецЕсли; 
	//ОбновитьРасписаниеНаСервере();
	//омРасписание.ЗаполнитьДатыСтадии(ЭтаФорма.Расписание,Объект.Стадии);
	//омРасписание.ЗаполнитьДатыЭтапов(ЭтаФорма.Расписание,Объект.Этапы);
	


КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеМонтажа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.Бригада КАК МонтажнаяБригада,
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.СрокИсполнения КАК МонтажСрокИсполнения,
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.КоличествоСотрудников КАК МонтажКоличествоСотрудников
		|ИЗ
		|	Справочник.МонтажныеКомплекты.ПроизводственныеКомплекты КАК МонтажныеКомплектыПроизводственныеКомплекты
		|ГДЕ
		|	МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект = &ПроизводственныйКомплект";
	
	Запрос.УстановитьПараметр("ПроизводственныйКомплект", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьДанныеМонтажа()


&НаСервере
Процедура ОбновитьРасписаниеНаСервере()
	
	//ЗначениеВРеквизитФормы(омРасписание.ПолучитьРасписаниеКомплекта(Объект.Ссылка), "Расписание");
	
КонецПроцедуры // ОбновитьРасписаниеНаСервере()


&НаКлиенте
Процедура РасписаниеПриИзменении(Элемент)
	РасписаниеИзменено = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//омКомплектКлиент.ПриОткрытии(ЭтаФорма,Объект.ТекущийЭтап);
	РасписаниеИзменено = Ложь;
	ВидимостьЭлементов();

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если РасписаниеИзменено Тогда
	
		Объект.Стадии.Очистить();
		Объект.Этапы.Очистить();
		
		ЭлементыДерева = Расписание.ПолучитьЭлементы();
		Для Каждого ЭлементДерева Из ЭлементыДерева Цикл 
            ЭлементЭтапы = ЭлементДерева.ПолучитьЭлементы();
			Для Каждого ЭлементЭтапа Из ЭлементЭтапы Цикл 
				ЗаполнитьЗначенияСвойств(Объект.Этапы.Добавить(),ЭлементЭтапа);
			КонецЦикла; 
			ЗаполнитьЗначенияСвойств(Объект.Стадии.Добавить(),ЭлементДерева);
		КонецЦикла; 
		РасписаниеИзменено = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПричиныПереноса(ПричинаПереноса,ДополнительныеПараметры) Экспорт

	Если ПричинаПереноса = Неопределено Тогда
		ПричинаПереноса = "";	
	КонецЕсли;
	
	омКанбан.ЗаписьВРегисрИзменениеКанбан(Объект.Ссылка,НачальныйЭтап,Объект.ТекущийЭтап,ПричинаПереноса);
	НачальныйЭтап = Объект.ТекущийЭтап;
	
КонецПроцедуры // ПослеВыбораПричиныПереноса()


&НаКлиенте
Процедура РасписаниеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РасписаниеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РасписаниеПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.Расписание.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Элемент.ТекущийЭлемент.Имя = "РасписаниеСтадия" Тогда
		ПоказатьЗначение(,ТД.Стадия);
		Отказ = Истина;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "РасписаниеЭтап" Тогда
		ПоказатьЗначение(,ТД.Этап);
		Отказ = Истина;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "РасписаниеИзделиеЗаказчика" Тогда
		ПоказатьЗначение(,ТД.ИзделиеЭлемент);
		Отказ = Истина;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "РасписаниеДатаНачала" ИЛИ Элемент.ТекущийЭлемент.Имя = "РасписаниеДатаОкончания" Тогда
		//Если ЗначениеЗаполнено(ТД.Этап) Тогда
		//	Отказ = Истина;
		//Иначе
			РасписаниеИзменено = Истина;
		//КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодрядчикиДатаНачалаПриИзменении(Элемент)
	ТД = Элементы.Подрядчики.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТД.ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Продолжительность) Тогда
		ТД.ДатаОкончания = омДаты.ДобавитьДниСУчетомВыходных(ТД.ДатаНачала, ТД.Продолжительность);  
	ИначеЕсли ЗначениеЗаполнено(ТД.ДатаОкончания) Тогда	
		ТД.Продолжительность = омДаты.КоличествоРабочихДней(ТД.ДатаНачала, ТД.ДатаОкончания);  
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодрядчикиПродолжительностьПриИзменении(Элемент)
	ТД = Элементы.Подрядчики.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТД.Продолжительность) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.ДатаОкончания) Тогда
		ТД.ДатаНачала = омДаты.ДобавитьДниСУчетомВыходных(ТД.ДатаОкончания, -ТД.Продолжительность);  
	ИначеЕсли ЗначениеЗаполнено(ТД.ДатаНачала) Тогда	
		ТД.ДатаОкончания = омДаты.ДобавитьДниСУчетомВыходных(ТД.ДатаНачала, ТД.Продолжительность);  
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодрядчикиДатаОкончанияПриИзменении(Элемент)
	ТД = Элементы.Подрядчики.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТД.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТД.Продолжительность) Тогда
		ТД.ДатаНачала = омДаты.ДобавитьДниСУчетомВыходных(ТД.ДатаОкончания, -ТД.Продолжительность);  
	ИначеЕсли ЗначениеЗаполнено(ТД.ДатаНачала) Тогда	
		ТД.Продолжительность = омДаты.КоличествоРабочихДней(ТД.ДатаНачала, ТД.ДатаОкончания);  
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИзделияЗаказчикаИзделияЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	омИзделиеЭлемент.ОткрытьПодборИзделийЭлемент(Объект,ЭтаФорма,СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделияЗаказчика(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТД = Элементы.ИзделияЭлемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.ИзделиеЭлемент = Результат; 
	
	Элементы.ИзделияЭлемент.Обновить();
КонецПроцедуры // ПослеВыбораИзделияЗаказчика()


&НаКлиенте
Процедура ТекущийЭтапНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(омКомплектСервер.ПолучитьРазрешенныеЭтапы(Объект.ТекущийЭтап,"Производство"));
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементов()
	Если ЗначениеЗаполнено(Объект.ИзделиеКомплект) Тогда
		Элементы.ИзделияЭлементЗаполнитьИзделия.Доступность = Истина;
	Иначе
		Элементы.ИзделияЭлементЗаполнитьИзделия.Доступность = Ложь;
	КонецЕсли;
	

КонецПроцедуры // ВидимостьЭлементов()


&НаСервереБезКонтекста
Функция ПолучитьСделку(ИзделиеКомплект)

	Возврат ИзделиеКомплект.Проект;	

КонецФункции // ПолучитьСделку()

&НаКлиенте
Процедура ИзделияЗаказчикаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзделияЗаказчикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Элемент.ТекущиеДанные.ИзделиеЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзделия(Команда)
	мИзделияЭлемент = ПолучитьИзделияЗаказчикаНаСервере(Объект.Ссылка,Объект.ИзделиеКомплект); 
	
	Объект.ИзделияЭлемент.Очистить();
	
	Для каждого ИзделиеЭлемент Из мИзделияЭлемент Цикл
	
		НС = Объект.ИзделияЭлемент.Добавить();	
	    НС.ИзделиеЭлемент = ИзделиеЭлемент;
		
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИзделияЗаказчикаНаСервере(ТекущийПроизводственныйКомплект,ИзделиеКомплект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводственныеКомплектыИзделияЗаказчика.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.ПроизводственныеКомплекты.ИзделияЭлемент КАК ПроизводственныеКомплектыИзделияЗаказчика
		|ГДЕ
		|	ПроизводственныеКомплектыИзделияЗаказчика.Ссылка.ИзделиеКомплект = &ИзделиеКомплект
		|	И ПроизводственныеКомплектыИзделияЗаказчика.Ссылка.Ссылка <> &ТекущийПроизводственныйКомплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЗаказчика
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент = вт.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЗаказчика.Ссылка = &ИзделиеКомплект
		|	И вт.ИзделиеЭлемент ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", ИзделиеКомплект);
	Запрос.УстановитьПараметр("ТекущийПроизводственныйКомплект", ТекущийПроизводственныйКомплект);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИзделиеЭлемент");
	

КонецФункции // ПолучитьИзделияЗаказчикаНаСервере()

&НаКлиенте
Процедура ПослеВыборкаКомплекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Объект.ИзделиеКомплект = Значение;
	
	Если ЗначениеЗаполнено(Объект.ИзделиеКомплект) Тогда
		Объект.Проект = ПолучитьСделку(Объект.ИзделиеКомплект);
	Иначе
		Объект.Проект = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	КонецЕсли;
	ВидимостьЭлементов();
КонецПроцедуры



&НаКлиенте
Процедура ИзделиеКомплектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.ИзделияЭлемент.Количество() = 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаКомплекта",ЭтаФорма);
		ОткрытьФорму("Справочник.ИзделияКомплект.ФормаВыбора",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеКомплекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Комплекта будет очищена табличная часть. Продоллжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСменеКомплекта(Результат, ДополнительныйПараметр) Экспорт
	Если Результат = КодВозвратаДиалога.ДА Тогда 
		Объект.ИзделияЭлемент.Очистить();
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаКомплекта",ЭтаФорма);
		ОткрытьФорму("Справочник.ИзделияКомплект.ФормаВыбора",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
    КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СозданиеЗаполнениеМонтажногоКомплекта(стДанные)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка КАК Ссылка,
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.СрокИсполнения КАК СрокИсполнения,
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.КоличествоСотрудников КАК КоличествоСотрудников,
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.Проект КАК Проект,
		|	МонтажныеКомплектыПроизводственныеКомплекты.Ссылка.Бригада КАК Бригада
		|ИЗ
		|	Справочник.МонтажныеКомплекты.ПроизводственныеКомплекты КАК МонтажныеКомплектыПроизводственныеКомплекты
		|ГДЕ
		|	МонтажныеКомплектыПроизводственныеКомплекты.ПроизводственныйКомплект = &ПроизводственныйКомплект";
	
	Запрос.УстановитьПараметр("ПроизводственныйКомплект", стДанные.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();

	текСсылка = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		текСсылка = Выборка.Ссылка;
		текСделка = Выборка.Сделка;
		текБригада = Выборка.Бригада;
		текСрокИсполнения = Выборка.СрокИсполнения;
		текКоличествоСотрудников = Выборка.КоличествоСотрудников;
	КонецЦикла; 
	
	Если текСсылка = Неопределено Тогда
		обМонтажныйКомплект = Справочники.МонтажныеКомплекты.СоздатьЭлемент();
		обМонтажныйКомплект.КоличествоСотрудников 	= стДанные.МонтажКоличествоСотрудников;
		обМонтажныйКомплект.Проект					= стДанные.Проект;
		обМонтажныйКомплект.СрокИсполнения			= стДанные.МонтажСрокИсполнения; 
		обМонтажныйКомплект.Бригада					= стДанные.МонтажнаяБригада; 
		НС = обМонтажныйКомплект.ПроизводственныеКомплекты.Добавить();
		НС.ПроизводственныйКомплект = стДанные.Ссылка;
		
		обМонтажныйКомплект.Записать();
	Иначе
		Если НЕ (текСрокИсполнения = стДанные.МонтажСрокИсполнения И текКоличествоСотрудников = стДанные.МонтажКоличествоСотрудников
			И текБригада = стДанные.МонтажнаяБригада И текСделка = стДанные.Проект) Тогда
			
			обМонтажныйКомплект = текСсылка.ПолучитьОбъект();
			обМонтажныйКомплект.КоличествоСотрудников 	= стДанные.МонтажКоличествоСотрудников;
			обМонтажныйКомплект.Проект					= стДанные.Проект;
			обМонтажныйКомплект.СрокИсполнения			= стДанные.МонтажСрокИсполнения; 
			обМонтажныйКомплект.Бригада					= стДанные.МонтажнаяБригада; 
			
			обМонтажныйКомплект.Записать();
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры // СозданиеЗаполнениеМонтажногоКомплекта()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	стДанные = Новый Структура("Ссылка,Проект,МонтажнаяБригада,МонтажСрокИсполнения,МонтажКоличествоСотрудников"
		,Объект.Ссылка,Объект.Проект);
	ЗаполнитьЗначенияСвойств(стДанные, ЭтаФорма); 
	СозданиеЗаполнениеМонтажногоКомплекта(стДанные);
КонецПроцедуры
